In [1]:
print("hello world")

hello world

In [2]:
#Numbers
#a=3 ; b=5  #a and b are number objects
a = 3
b = 5
print(a)
print(b)

3
5

In [3]:
a = 3
b = 5
print(a + b) #addition
print(a - b) #sutraction
print (a * b) #Multiplication
print          (a / b) #dividation
print(type(b))

8
-2
15
0.6
<class 'int'>

In [4]:
#String
str1 = 'Hello Students' #string str1
str2 = ' how are you' #string str2

In [5]:
print(str1)
print(str2)

Hello Students
 how are you

In [6]:
str11 = 'Hello students '
str2 = 'how r u'

In [7]:
print(str11)
print(str2)
print(str1)

Hello students
how r u
Hello Students

In [8]:
Name  = "Pranav"
Middle_name = ' Pravin'
Surname = " Gandhi"
Address = ' Pune, Maharashtra'
Name + Middle_name + Surname + Address #concatenation

'Pranav Pravin Gandhi Pune, Maharashtra'

In [9]:
str1
str2

'how r u'

In [10]:
str1

'Hello Students'

In [11]:
str2

'how r u'

In [12]:
print (Address[7:]) #printing first five character using slice operator

Maharashtra

In [13]:
(str1[0:3])

'Hel'

In [14]:
print (str1[4]) #printing 5th character of the string

o

In [15]:
print(str1*2) #printing the string twice

Hello StudentsHello Students

In [16]:
print (str1 + " " + str2) #printing the concatenation of str1 and str2

Hello Students how r u

In [17]:
#Lists
list_1  = [1, "hi", "python", True, "a", "Santosh", 'Mango']

In [18]:
print (list_1[1:])

['hi', 'python', True, 'a', 'Santosh', 'Mango']

In [19]:
print (list_1[0:2])

[1, 'hi']

In [20]:
print (list_1)

[1, 'hi', 'python', True, 'a', 'Santosh', 'Mango']

In [22]:
print (list_1 + list_1)

[1, 'hi', 'python', True, 'a', 'Santosh', 'Mango', 1, 'hi', 'python', True, 'a', 'Santosh', 'Mango']

In [23]:
print (list_1 * 3)

[1, 'hi', 'python', True, 'a', 'Santosh', 'Mango', 1, 'hi', 'python', True, 'a', 'Santosh', 'Mango', 1, 'hi', 'python', True, 'a', 'Santosh', 'Mango']

In [24]:
print (type(list_1))
type(list_1)

<class 'list'>

list

In [25]:
list_1

[1, 'hi', 'python', True, 'a', 'Santosh', 'Mango']

In [26]:
#Lets try mutation 
list_1[1] = "Bye"

In [27]:
print (list_1) #Bye get added to existing list

[1, 'Bye', 'python', True, 'a', 'Santosh', 'Mango']

In [28]:
#Tuple
t  = ('hi', 'python', 2, 4, "world", "ravi", True, 4.5)

In [29]:
t

('hi', 'python', 2, 4, 'world', 'ravi', True, 4.5)

In [30]:
print (t[1:]) ; print(t) #Semicolon is optional for single line but for multiple lines to execute we have to put it

('python', 2, 4, 'world', 'ravi', True, 4.5)
('hi', 'python', 2, 4, 'world', 'ravi', True, 4.5)

In [31]:
print (t[0:3])

('hi', 'python', 2)

In [32]:
print (t)

('hi', 'python', 2, 4, 'world', 'ravi', True, 4.5)

In [33]:
print (t + t)

('hi', 'python', 2, 4, 'world', 'ravi', True, 4.5, 'hi', 'python', 2, 4, 'world', 'ravi', True, 4.5)

In [34]:
print (t * 3)

('hi', 'python', 2, 4, 'world', 'ravi', True, 4.5, 'hi', 'python', 2, 4, 'world', 'ravi', True, 4.5, 'hi', 'python', 2, 4, 'world', 'ravi', True, 4.5)

In [35]:
print (type(t))

<class 'tuple'>

In [36]:
t

('hi', 'python', 2, 4, 'world', 'ravi', True, 4.5)

In [37]:
#Lets try mutation 
t[1] = "Bye"         #trows error, as tuple object does not support item assignement

TypeError: 'tuple' object does not support item assignment

In [38]:
print (t)

('hi', 'python', 2, 4, 'world', 'ravi', True, 4.5)

In [39]:
#Dictionary
d = {101:"Jimmy", 222:'Alex', 333:'john', 40:'mike'}

In [40]:
d

{101: 'Jimmy', 222: 'Alex', 333: 'john', 40: 'mike'}

In [43]:
print("1st name is " + d[101])

1st name is Jimmy

In [44]:
print("2nd name is " + d[40])

2nd name is mike

In [45]:
print (d);

{101: 'Jimmy', 222: 'Alex', 333: 'john', 40: 'mike'}

In [46]:
print (d.keys());

dict_keys([101, 222, 333, 40])

In [47]:
print (d.values());

dict_values(['Jimmy', 'Alex', 'john', 'mike'])

In [1]:
#----ADVANCED----
#list
#ordered collection of items; sequence of items in a list
shoplist =['apple','carrot','mango', 'banana']

In [2]:
shoplist

['apple', 'carrot', 'mango', 'banana']

In [3]:
len(shoplist)

4

In [4]:
print(shoplist)

['apple', 'carrot', 'mango', 'banana']

In [5]:
#add item to list
shoplist.append('rice')

In [6]:
shoplist

['apple', 'carrot', 'mango', 'banana', 'rice']

In [7]:
#sort
shoplist.sort()  #inplace sort

In [8]:
shoplist

['apple', 'banana', 'carrot', 'mango', 'rice']

In [9]:
#index/select
shoplist[0]

'apple'

In [10]:
shoplist[0:4]

['apple', 'banana', 'carrot', 'mango']

In [11]:
#delete item
del shoplist[0]

In [12]:
shoplist

['banana', 'carrot', 'mango', 'rice']

In [13]:
#Tuple
#Used to hold multiple object; similar to lists; less functionality than list
#immutable - cannot modify
zoo = ('python','lion','elephant','bird')

In [14]:
zoo

('python', 'lion', 'elephant', 'bird')

In [15]:
len(zoo)

4

In [16]:
languages = 'c', 'java', 'php' , 1, "c++"              #better to put (), this also works

In [17]:
languages

('c', 'java', 'php', 1, 'c++')

In [18]:
type(languages)

tuple

In [ ]:
#Dictionary - like an addressbook. use of associate keys with values
#key-value pairs { 'key1':value1, 'key2':value2} ; { } bracket, :colon

In [19]:
student = {'A101': 'Abhinav', 'A102': 'Ravi', 'A103':'Prafull', 'A104': 'Karan'}

In [20]:
student

{'A101': 'Abhinav', 'A102': 'Ravi', 'A103': 'Prafull', 'A104': 'Karan'}

In [21]:
student['A103']

'Prafull'

In [ ]:
print('Name of rollno A103 is ' + student['A103'])

In [ ]:
del student['A104']

In [ ]:
student

In [ ]:
len(student)

In [ ]:
#Lets test Mutation: 
#adding a value
student['A104'] = 'Hitesh'

In [ ]:
student

In [ ]:
#Set
Anubhav = {1,2,3,4,5,4,2,5,5,5,5,5,5}

In [ ]:
Anubhav

In [ ]:
Aman_1 = set() #Empty set creation using set function

In [ ]:
Aman_1

In [ ]:
a = list() #Empty list creation

In [ ]:
a

In [ ]:
b = tuple()

In [ ]:
b

In [ ]:
c = dict()

In [ ]:
c

In [22]:
d = series() #cause series() is available in pandas, we need to import pandas for this, that we will see when we study pandas package

NameError: name 'series' is not defined

In [23]:
e = DataFrame() #cause DataFrame() is available in pandas, we need to import pandas for this, that we will see when we study pandas package

NameError: name 'DataFrame' is not defined

In [ ]:
#Sets
teamA = set(['india','england','australia','sri lanka','ireland'])

In [ ]:
teamA

In [ ]:
teamB = set(['pakistan', 'south africa','bangladesh','ireland'])

In [ ]:
teamB

In [ ]:
#Checking whether a data value exists in a set or not.
'india' in teamA

In [ ]:
'india' in teamB

In [ ]:
#Adding values in a set
teamA.add('China')

In [ ]:
teamA

In [ ]:
teamA.add('india')

In [ ]:
teamA  #no duplicates

In [ ]:
teamA.remove('australia')

In [ ]:
teamA

In [24]:
#Create dataframe :
import pandas as pd

In [25]:
#Create a DataFrame
d = {'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine',
            'Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
     
     
     
     
    'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1',
           'Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
     
     
     
     
   'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
                               'Mathematics','Mathematics','Mathematics','Science','Science','Science'],
     
 
     
     
    'Score':[62,47,55,74,31,77,85,63,42,67,89,81]}

In [26]:
d

{'Name': ['Alisa',
  'Bobby',
  'Cathrine',
  'Alisa',
  'Bobby',
  'Cathrine',
  'Alisa',
  'Bobby',
  'Cathrine',
  'Alisa',
  'Bobby',
  'Cathrine'],
 'Exam': ['Semester 1',
  'Semester 1',
  'Semester 1',
  'Semester 1',
  'Semester 1',
  'Semester 1',
  'Semester 2',
  'Semester 2',
  'Semester 2',
  'Semester 2',
  'Semester 2',
  'Semester 2'],
 'Subject': ['Mathematics',
  'Mathematics',
  'Mathematics',
  'Science',
  'Science',
  'Science',
  'Mathematics',
  'Mathematics',
  'Mathematics',
  'Science',
  'Science',
  'Science'],
 'Score': [62, 47, 55, 74, 31, 77, 85, 63, 42, 67, 89, 81]}

In [27]:
df = pd.DataFrame(d,columns=['Exam','Subject','Score','Name']) #Dataframes are 2 dimensional array

In [32]:
import pandas as pd
df

          Exam      Subject  Score      Name
0   Semester 1  Mathematics     62     Alisa
1   Semester 1  Mathematics     47     Bobby
2   Semester 1  Mathematics     55  Cathrine
3   Semester 1      Science     74     Alisa
4   Semester 1      Science     31     Bobby
5   Semester 1      Science     77  Cathrine
6   Semester 2  Mathematics     85     Alisa
7   Semester 2  Mathematics     63     Bobby
8   Semester 2  Mathematics     42  Cathrine
9   Semester 2      Science     67     Alisa
10  Semester 2      Science     89     Bobby
11  Semester 2      Science     81  Cathrine

In [35]:
#View a column of the dataframe in pandas:

df ['Name']

#df [['Name']]

0        Alisa
1        Bobby
2     Cathrine
3        Alisa
4        Bobby
5     Cathrine
6        Alisa
7        Bobby
8     Cathrine
9        Alisa
10       Bobby
11    Cathrine
Name: Name, dtype: object

In [38]:
#View two columns of the dataframe in pandas:

df [['Name','Score','Exam']]

        Name  Score        Exam
0      Alisa     62  Semester 1
1      Bobby     47  Semester 1
2   Cathrine     55  Semester 1
3      Alisa     74  Semester 1
4      Bobby     31  Semester 1
5   Cathrine     77  Semester 1
6      Alisa     85  Semester 2
7      Bobby     63  Semester 2
8   Cathrine     42  Semester 2
9      Alisa     67  Semester 2
10     Bobby     89  Semester 2
11  Cathrine     81  Semester 2

In [39]:
#View first two rows of the dataframe in pandas:
df[0:2]

         Exam      Subject  Score   Name
0  Semester 1  Mathematics     62  Alisa
1  Semester 1  Mathematics     47  Bobby

In [40]:
import pandas as pd
import numpy as np


# Creating empty series (Series is a single dimentional array)
ser = pd.Series()

print(ser)

Series([], dtype: float64)

C:\Users\Pranav\AppData\Local\Temp/ipykernel_33976/1756714237.py:6: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series()

In [44]:
# simple array
data = np.array(['g', 'e', 'e', 'k', 's'])

ser = pd.Series(data)
print(data)
print("\n")
print(ser)

['g' 'e' 'e' 'k' 's']


0    g
1    e
2    e
3    k
4    s
dtype: object

In [45]:
data = np.array(['g', 'e', 'e', 'k', 's'])

ser = pd.Series(data, name = "Trial")
print(ser)

0    g
1    e
2    e
3    k
4    s
Name: Trial, dtype: object